## Plan for org_account/cost_usage_report
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 3 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `aws_iam_policy.cur_replicate`                                       |
|        | `aws_iam_role.cur_replicate`                                         |
|        | `aws_iam_role_policy_attachment.cur_replicate`                       |
| delete | `aws_s3_bucket_policy.billing_extract_tags`                          |
|        | `module.billing_extract_tags.aws_s3_bucket.this`                     |
|        | `module.billing_extract_tags.aws_s3_bucket_public_access_block.this` |
| update | `aws_iam_policy.billing_extract_tags`                                |
|        | `aws_lambda_function.billing_extract_tags`                           |
|        | `module.cost_usage_report.aws_s3_bucket.this`                        |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.billing_extract_tags will be updated in-place
  ~ resource "aws_iam_policy" "billing_extract_tags" {
        id        = "arn:aws:iam::659087519042:policy/BillingExtractTags"
        name      = "BillingExtractTags"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                    # (1 unchanged element hidden)
                    {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:CreateLogStream",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:logs:ca-central-1:659087519042:log-group:/aws/lambda/billing_extract_tags:*"
                    },
                  ~ {
                      ~ Action   = [
                          - "s3:PutObject*",
                          - "s3:ListBucket",
                          - "s3:GetObject*",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject*",
                        ] -> "s3:PutObject"
                      ~ Resource = [
                          - "arn:aws:s3:::cds-account-billing-extract-tags/*",
                          - "arn:aws:s3:::cds-account-billing-extract-tags",
                        ] -> "arn:aws:s3:::cds-data-lake-raw-production/operations/aws/organization/account-tags.json"
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags      = {
            "CostCentre" = "cds-aws-lz-production"
            "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_iam_policy.cur_replicate will be created
  + resource "aws_iam_policy" "cur_replicate" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "CostUsageReplicateToDataLake"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetReplicationConfiguration",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cds-cost-usage-report"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObjectVersionAcl",
                          + "s3:GetObjectVersion",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cds-cost-usage-report/*"
                    },
                  + {
                      + Action   = [
                          + "s3:ReplicateObject",
                          + "s3:ReplicateDelete",
                          + "s3:ObjectOwnerOverrideToBucketOwner",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::cds-data-lake-raw-production/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.cur_replicate will be created
  + resource "aws_iam_role" "cur_replicate" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "CostUsageReplicateToDataLake"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "cds-aws-lz-production"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.cur_replicate will be created
  + resource "aws_iam_role_policy_attachment" "cur_replicate" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "CostUsageReplicateToDataLake"
    }

  # aws_lambda_function.billing_extract_tags will be updated in-place
  ~ resource "aws_lambda_function" "billing_extract_tags" {
        id                             = "billing_extract_tags"
      ~ last_modified                  = "2024-11-06T21:23:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "tuYDTu43qo+6Z5hsmZctAh5OeQ1XygVO+qRzDe65sIk=" -> "GhHrABYn5HQ9rbHuG9SQDeXQMQsY0E5gj3cGrFsJYP8="
        tags                           = {
            "CostCentre" = "cds-aws-lz-production"
            "Terraform"  = "true"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "TARGET_BUCKET" = "cds-account-billing-extract-tags" -> "cds-data-lake-raw-production"
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket_policy.billing_extract_tags will be destroyed
  # (because aws_s3_bucket_policy.billing_extract_tags is not in configuration)
  - resource "aws_s3_bucket_policy" "billing_extract_tags" {
      - bucket = "cds-account-billing-extract-tags" -> null
      - id     = "cds-account-billing-extract-tags" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObject*",
                          - "s3:ListBucket",
                          - "s3:GetObject*",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject*",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::659087519042:role/BillingExtractTags"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::cds-account-billing-extract-tags/*",
                          - "arn:aws:s3:::cds-account-billing-extract-tags",
                        ]
                    },
                  - {
                      - Action    = [
                          - "s3:ListMultipartUploadParts",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::066023111852:root"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::cds-account-billing-extract-tags/*",
                          - "arn:aws:s3:::cds-account-billing-extract-tags",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
    }

  # module.billing_extract_tags.aws_s3_bucket.this will be destroyed
  # (because aws_s3_bucket.this is not in configuration)
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::cds-account-billing-extract-tags" -> null
      - bucket                      = "cds-account-billing-extract-tags" -> null
      - bucket_domain_name          = "cds-account-billing-extract-tags.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "cds-account-billing-extract-tags.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "cds-account-billing-extract-tags" -> null
      - object_lock_enabled         = false -> null
      - policy                      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = [
                          - "s3:PutObject*",
                          - "s3:ListBucket",
                          - "s3:GetObject*",
                          - "s3:GetBucketLocation",
                          - "s3:DeleteObject*",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::659087519042:role/BillingExtractTags"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::cds-account-billing-extract-tags/*",
                          - "arn:aws:s3:::cds-account-billing-extract-tags",
                        ]
                    },
                  - {
                      - Action    = [
                          - "s3:ListMultipartUploadParts",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::066023111852:root"
                        }
                      - Resource  = [
                          - "arn:aws:s3:::cds-account-billing-extract-tags/*",
                          - "arn:aws:s3:::cds-account-billing-extract-tags",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "CostCentre" = "cds-aws-lz-production"
          - "Critical"   = "false"
          - "Terraform"  = "true"
        } -> null
      - tags_all                    = {
          - "CostCentre" = "cds-aws-lz-production"
          - "Critical"   = "false"
          - "Terraform"  = "true"
        } -> null

      - grant {
          - id          = "25b295e1922069b04c7a73186f3a08bead60b7565ffee84d635391167d484fa0" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm = "AES256" -> null
                }
            }
        }

      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }
    }

  # module.billing_extract_tags.aws_s3_bucket_public_access_block.this will be destroyed
  # (because aws_s3_bucket_public_access_block.this is not in configuration)
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "cds-account-billing-extract-tags" -> null
      - id                      = "cds-account-billing-extract-tags" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }

  # module.cost_usage_report.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cds-cost-usage-report"
        tags                        = {
            "CostCentre" = "cds-aws-lz-production"
            "Critical"   = "false"
            "Terraform"  = "true"
        }
        # (12 unchanged attributes hidden)

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + id       = "send-to-data-lake"
              + priority = 10
              + status   = "Enabled"

              + destination {
                  + bucket = "arn:aws:s3:::cds-data-lake-raw-production"
                }

              + filter {}
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

Warning: Argument is deprecated

  with module.cost_usage_report.aws_s3_bucket.this,
  on .terraform/modules/cost_usage_report/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
